# ReinEstBarVolume Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ReinEstBarVolume Property
ParameterTypeId Class See Also
---
"Estimated Reinforcement Volume"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ReinEstBarVolume { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ReinEstBarVolume As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ReinEstBarVolume {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace